import "@/assets/style.scss";

import Breadcrumb from "@/components/PageView/Breadcrumb";

import React from "react";

const PolicyComponent = () => {
	return (
		<div className="p-8 max-w-4xl mx-auto space-y-6 text-gray-200 text-lg">
			<h1 className="text-3xl font-bold">Условия и положения</h1>

			<section className="flex flex-col gap-4">
				<h6 className="text-xl">Добро пожаловать в VOKALO!</h6>
				<p>
					Добро пожаловать в VOKALO. Через этот веб-сайт вы можете получить доступ к продуктам нашей компании.
					Заходя на наш веб-сайт и используя наши инструменты, вы соглашаетесь соблюдать настоящие условия. Мы
					можем изменять эти условия, а также продукты, цены и услуги на этом веб-сайте в любое время. VOKALO
					будет использовать все доступные средства правовой защиты для исправления и пресечения нарушений
					настоящих Условий.
				</p>
			</section>
			<section className="flex flex-col gap-4">
				<h6 className="text-xl">Авторское право</h6>
				<p>
					Все содержимое этого веб-сайта является объектом авторского права VOKALO. Все права защищены.
					Авторское право включает, но не ограничивается, графику, использование инструментов, логотипы, звуки
					и текст. В общем, вы не можете воспроизводить какую-либо часть этого веб-сайта без предварительного
					письменного разрешения VOKALO. Существует только два исключения из этого правила:
				</p>
				<p className="ps-10">
					Вы можете сохранить копию этого веб-сайта и его содержимого на свой жесткий диск. Однако вы можете
					использовать ее только для личного, некоммерческого использования. Вы можете копировать контент для
					третьих лиц для их собственного некоммерческого использования. При этом вы должны указать этот
					веб-сайт в качестве источника.
				</p>
				<h6>Подробнее об Авторском праве:</h6>

				<p className="ps-10">
					Описание Услуги VOKALO использует технологию ИИ для предоставления различных услуг, включая
					преобразование текста в речь, генерацию аудио, ИИ-рисование, ИИ-каверы, ИИ-музыку и т.д.
					Пользователи вводят текст, аудио и другую информацию через страницу сервиса, и VOKALO будет
					генерировать соответствующие творческие работы на основе введенного пользователем контента.
					Содержание услуги будет постоянно обновляться по мере развития технологий и получения отзывов
					пользователей. 1.1 Функции ИИ включают: преобразование текста в речь, преобразование голоса в речь,
					ИИ-рисование, ИИ-каверы, ИИ-музыку.
				</p>

				<p className="ps-10">
					Спецификации использования и Правила пользования 2.1 При использовании данной услуги пользователи
					должны соблюдать применимые законы, нормативные акты и положения политики, и не должны использовать
					эту услугу для участия в незаконной деятельности или создания незаконного контента. Запрещено
					производить, загружать, публиковать и распространять следующие типы информации или осуществлять
					следующие действия, включая, но не ограничиваясь: Нарушение международно признанных законов и
					нормативных актов или местных законов и нормативных актов целевого рынка. Контент, нарушающий права
					других лиц (например, право на неприкосновенность частной жизни, права интеллектуальной
					собственности и т.д.). Распространение разжигающих ненависть высказываний, насилия, порнографии,
					терроризма и другого подобного контента. Контент, нарушающий законные права и интересы других лиц
					или общественные интересы. 2.2 Пользователи должны гарантировать, что вводимые данные являются
					законными и соответствуют требованиям, и что пользователь имеет законное право на использование
					данных или получил необходимое разрешение. Пользователь также предоставляет VOKALO неисключительные
					права на использование в рамках предоставления услуги. 2.3 VOKALO оставляет за собой право проверять
					вводимый пользователем контент и сгенерированные результаты. Если контент нарушает правила, VOKALO
					имеет право удалить или заблокировать контент. 2.4 В соответствии с требованиями законов и
					нормативных актов, VOKALO будет автоматически помечать соответствующим знаком "сгенерированный
					контент принадлежит ИИ", и пользователи не должны удалять или изменять такие знаки без разрешения.
					2.5 При использовании этой услуги пользователи должны соблюдать следующие правила: Соблюдать законы
					и нормативные акты и уважать законные права и интересы других лиц. Эта услуга не должна
					использоваться для разработки или улучшения продуктов, конкурирующих с VOKALO. Контент или данные,
					сгенерированные сервисом, не должны получаться ненадлежащими способами. Запрещается проводить
					обратное проектирование, обратную сборку или пытаться взломать исходный код этой услуги.
				</p>

				<p className="ps-10">
					Ограничение ответственности 3.1 Пользователи понимают и соглашаются, что, хотя VOKALO приложила все
					усилия, она не может гарантировать, что эта услуга полностью удовлетворяет потребности
					пользователей, а также не может гарантировать точность, надежность и законность сгенерированного
					контента. 3.2 Сгенерированный контент предназначен только для справки и не является юридической,
					медицинской или иной профессиональной консультацией. VOKALO не несет ответственности за результаты
					использования сгенерированного контента. 3.3 VOKALO имеет право изменять или прекращать
					предоставление определенного контента услуги при необходимости в соответствии с законами,
					нормативными актами или требованиями третьих лиц без предварительного уведомления пользователей или
					несения ответственности.
				</p>

				<p className="ps-10">
					Жалобы и апелляции 4.1 Если пользователь считает, что его права были нарушены или обнаружил
					незаконную информацию, он может подать жалобу в VOKALO по электронной почте (info@vokalo.online).
					4.2 Пользователи могут представить соответствующие материалы для апелляции, и VOKALO ответит в
					течение 5 рабочих дней после получения апелляции.
				</p>

				<p className="ps-10">
					Вопросы коммерческого авторского права на ИИ-музыку, ИИ-каверы песен, обучение моделей и
					клонирование голоса:
				</p>

				<p className="ps-15">
					Использование вашего голоса для кавера: Если вы получили права на коммерческое использование или
					права собственности на оригинальную песню и используете свой голос для ее кавера с помощью нашего
					ИИ, право собственности и права на коммерческое использование сгенерированной кавер-версии
					принадлежат вам. Клонирование голосов других людей: Получение согласия: После клонирования голоса
					другого человека и получения его разрешения, право собственности и права на коммерческое
					использование сгенерированной кавер-версии принадлежат вам. Измененный голос: Если клонированный
					звук был значительно изменен и больше не узнаваем, право собственности и права на коммерческое
					использование полученной кавер-версии принадлежат вам. Использование голосов платформы: Используйте
					голоса, встроенные в нашу платформу, для исполнения каверов, и право собственности и права на
					коммерческое использование сгенерированных кавер-версий принадлежат вам.
				</p>

				<p className="ps-10">
					О музыке, сгенерированной платформой: Музыкальные произведения (включая кавер-версии песен),
					сгенерированные на нашей платформе, принадлежат вам. Наш алгоритм использует очень сложные методы,
					чтобы гарантировать уникальность и высокое качество сгенерированной музыки. Об обучении голоса: Если
					вы обучаете пользовательскую звуковую модель с использованием нашей платформы, модель и генерируемые
					ею голоса принадлежат вам. Если у вас есть дополнительные вопросы, пожалуйста, свяжитесь с нами
					(support@vokalo.online)! Спасибо за вашу поддержку!
				</p>
			</section>
			<section className="flex flex-col gap-4">
				<h6 className="text-xl">Освобождение от ответственности</h6>
				<p>
					Заходя на этот сайт или используя наши онлайн-инструменты, вы освобождаете VOKALO от любых
					обязательств, претензий, затрат, убытков, расходов или иных оснований для иска. Вы соглашаетесь не
					привлекать VOKALO к ответственности за любые проблемы, возникающие в результате использования вами
					наших продуктов, доступа к нашему веб-сайту или любой другой коммуникации между вами и VOKALO.
				</p>
			</section>
			<section className="flex flex-col gap-4">
				<h6 className="text-xl">Товарные знаки</h6>
				<p>
					"VOKALO" является зарегистрированным товарным знаком VOKALO. Вы не можете использовать этот
					зарегистрированный товарный знак для любого контента, программного обеспечения или других продуктов
					или услуг, которые не производятся VOKALO. Мы будем преследовать нарушителей закона о товарных
					знаках и авторском праве.
				</p>
			</section>
			<section className="flex flex-col gap-4">
				<h6 className="text-xl">Ссылки на другие веб-сайты</h6>
				<p>
					Во время просмотра нашего веб-сайта вы можете столкнуться со ссылками на сторонние веб-сайты,
					которые не находятся под контролем VOKALO. Мы не контролируем эти ресурсы. Поэтому мы не можем
					одобрять их контент, политику конфиденциальности или передовые практики. Вы несете полную
					ответственность за посещение сторонних веб-сайтов. На этих веб-сайтах настоящие условия больше не
					применяются к вам. Пожалуйста, ознакомьтесь с условиями и другими соответствующими юридическими
					текстами на этих веб-сайтах.
				</p>
			</section>
			<section className="flex flex-col gap-4">
				<h6 className="text-xl">Обратная связь</h6>
				<p>
					Мы рады вашим отзывам! Мы любим получать сообщения от наших пользователей, независимо от причины
					запроса или комментария. Мы открыты для предложений о том, как улучшить наши продукты, и будем рады
					услышать ваши советы о том, как улучшить наш веб-сайт. Если вы хотите поделиться с нами своим
					мнением, пожалуйста, свяжитесь с нами и сообщите об этом.
				</p>
				<p>
					Однако, если вы предоставляете нам свой отзыв, мы вправе использовать этот отзыв без ограничений.
					Предоставляя нам свой отзыв, вы также соглашаетесь с тем, что VOKALO не будет компенсировать вам
					вашу идею, предложение или критику.
				</p>
			</section>
			<section className="flex flex-col gap-4">
				<h6 className="text-xl">Отказ от ответственности</h6>
				<p>
					VOKALO предоставляет онлайн-инструменты на этом веб-сайте только для законных целей. Вы никогда не
					должны копировать наши инструменты на устройство, которым вы не владеете или на использование
					которого у вас нет явного разрешения от владельца. Установка при любых из этих условий может
					нарушать законы вашей страны или региона, что может привести к серьезным уголовным или гражданским
					последствиям. Перед использованием наших продуктов, пожалуйста, проконсультируйтесь с
					юрисконсультом, чтобы убедиться, что ваш сценарий использования не нарушает никаких законов. Вы
					принимаете на себя полную ответственность за использование инструментов VOKALO. VOKALO не несет
					ответственности, если вы используете наши инструменты способом, который является незаконным в вашей
					юрисдикции, включая, но не ограничиваясь, несанкционированную установку на телефон другого человека
					и несанкционированный доступ к устройству. VOKALO не может предоставлять и не предоставляет
					юридические консультации относительно вашего предполагаемого использования. Все права, не
					предоставленные явно в настоящем документе, защищены и сохраняются за VOKALO.
				</p>
			</section>
		</div>
	);
};

export default function Home() {
	return (
		<main className="">
			<Breadcrumb>
				<span className="px-3 py-2 bg-gray-900 rounded-lg text-sm">VOKALO | Творчество без границ</span>
				<PolicyComponent />
			</Breadcrumb>
		</main>
	);
}
